package com.edu;

public class Memo {

	@소프트웨어 테스트 정의 및 설명
	-소프트웨어 테스트 정의: 시스템이나 시스템의 구성 요소 또는 SW 프로그램을
	실행하고 평가하는 과정

	@테스트의 목적
	-개발된 결과물을 검증 및 확인하여 최종 사용자에게 안정적이고 성능이 뛰어난 
	소프트웨어를 제공하는 것
	
	@테스트 활동
	최종 사용자에게 제공되기 전에 제품의 결함을 찾는 모든 활동을 포함
	소프트웨어의 정확성, 완성도, 성능을 테스트 및 측정하여 지표를 제공하는 작업
	***테스트는 프로젝트 전반에 걸쳐서 수행됨
	
	@소프트웨어 테스트 절차
	테스트 계획 -> 테스트 설계 -> 테스트 데이터 생성 -> TestCase 작성 -> 테스트 수행
	테스트 결과 점검
	
	@소프트웨어 생명주기
	요구사항 분석(Analysis) -> 설계(Design) -> 구현(Coding) 
	-> 테스트 -> 유지보수(Maintenance)
	
	소프트웨어 생명주기 종류
	1. 폭포수 모델
	특징:
	소프트웨어 개발의 각 단계가 순차적으로 진행
	각 단계 종료 후 다음 단계 진행
	단순하거나 응용 분야를 잘 알고 있는 경우 적합한 모델
	단점:
	소프트웨어의 요구사항이 초기에 명확하게 정의되기 어려움
	소프트웨어가 개발 후반부에 구체화됨
	중요한 문제점들이 뒤늦게 발견됨
	
	-단계
	계획 수립 -> 요구사항 분석 -> 설계 -> 구현 -> 테스트 -> 유지보수
	
	2.프로토타이핑 모델
	특징:
	요구사항이 초기에 결정되면 개발단계에서 유지보수가 일어남
	요구사항이 불분명한 경우 유용한 모델
	단점:
	고객은 시제품을 통해 구현된 기능을 확인 가능함
	품질에 대한 확인의 어려움
	시제품 작동을 데모하기 위해 적절하지 않은 프로그래밍 언어 및 비효율적인 
	알고리즘이 사용되는 경우가 많음
	
	-단계
	요구사항 수집 -> 프로토타입 설계 -> 프로토타입 개발 -> 
	고객 평가 -> 프로토타입 정제 -> 요구사항 수집 -> 무한반복...
	
	
	
	
	
	
		
		
		
		
		
	
		
		
		
		
		
		
	
}
