package one;

public class CollectionBasic1 {

//	컬렉션 프레임웍(Collection Framework)
		
//	@컬렉션 프레임웍이란?
//	데이터 군을 저장하는 클래스들을 표준화한 설계를 뜻한다
//	컬렉션은 다수의 데이터, 즉 데이터 그룹을, 
//	프레임웍은 표준화된 프로그래밍 방식을 의미한다
//	
//	컬렉션 프레임웍은 다수의 데이터들을 다루는 데 필요한 다양하고 풍부한
//	클래스들을 제공하기 때문에 프로그래머의 짐을 상당히 덜어 준다
//	
//	특히 인터페이스와 다형성을 이용한 객체지향적 설계를 통해 표준화되어 있기 때문에
//	이들을 활용하면 재사용성이 높은 객체지향적 코드를 작성할 수 있다는 장점이 있다
//	
//	@핵심 인터페이스
//	컬렉션 프레임웍에서는 크게 3가지 타입이 존재한다
//	List, Set, Map 이다
//	
//	이 중 List와 Set은 공통적인 특징이 있어
//	Collection을 추가로 정의 하였다
//	
//				@컬렉션 프레임웍의 핵심 인터페이스와 특징
//	인터페이스				특징
//	List		순서가 있는 데이터의 집합, 데이터의 중복을 허용한다
//				ex) 대기자 명단
//				구현클래스: ArrayList, LinkedList, Stack, Vector등
//	Set			순서를 유지하지 않는 데이터의 집합, 데이터의 중복을 허용하지 않는다
//				구현클래스: HashSet, TreeSet등
//	Map			키(key)와 값(value)의 쌍(pair)으로 이루어진 데이터의 집합
//				순서는 유지되지 않으며, 키는 중복을 허용하지 않고, 값은 중복을 허용한다
//				ex) 우편번호, 지역번호(전화번호)
//				구현클래스: HashMap, TreeMap, HashTable, Properties등
				
				
	
	
	
	
	
	
	
}
